first_routes/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Thurdguy"], ["email", "3@aa.com"], ["updated_at", "2021-02-03 21:27:51.938847"], ["id", 3]]
---
    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)